*** Dipl-level missing per language
#+BEGIN_SRC python :results output :export results :var data=Arbejdsgange :preamble "# -*- coding: utf-8 -*-"  
import os
header = data[1]
rows = data[2:]
code = header.index("number")
lang = header.index("language")
dipl = header.index("dipl trans.")

unfinished = 0

for a in rows:
   #if a[lang] == "Latin":
   if a[lang] == "Dansk" or a[lang] == "Svensk" or a[lang] == "Nedertysk":
      if not a[dipl]:
         unfinished += 1
         print a[code]
print "Unfinished: " + str(unfinished)
#+END_SRC

#+RESULTS:
#+begin_example
16
30
43
68
75
85
86
89
92
93
114
155
164
180
188
189
190
191
192
193
194
196
199
208
209
228
231
232
248
261
262
263
269
270
271
272
285
286
287
288
289
290
291
292
293
294
295
296
298
299
300
301
302
303
314
321
328
333
335
341
343
346
352
353
354
364
370
383
386
391
415
427
428
450
471
472
473
474
475
476
477
479
480
481
482
483
484
485
486
487
Unfinished: 90
#+end_example
